#### IsConnectedTo Method

---

|  |
| --- |
| Connector Class   See Also |

Identifies if the connector is connected to the specified connector.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsConnectedTo( 	Connector connector ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsConnectedTo ( _ 	connector As Connector _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsConnectedTo( 	Connector^ connector ) ``` |

#### Parameters

connector
:   Type:  Autodesk.Revit.DB Connector

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the argument is    a null reference (  Nothing  in Visual Basic)  . |

# See Also

Connector Class

Autodesk.Revit.DB Namespace